import 'package:flutter/material.dart';

class Question {
  final String title;
  final List<Map> answers;

  Question({
    @required this.title,
    @required this.answers,
  });
}

class QuestionData {
  final _data = [
    Question(
        title: 'Какой из соборов Петербурга построен в честь Александра II?',
        answers: [
          {
            'answer': 'Спасо-Преображенский собор',
          },
          {
            'answer': 'Собор Спаса Нерукотворного',
          },
          {
            'answer': 'Спас на Крови (Собор Воскресения Христова на Крови)',
            'isCorrect': 1
          },
          {
            'answer': 'Троице-Измайловский собор',
          },
        ]),
    Question(
        title:
            'Какой мост через Неву одним концом упирается в Суворовскую площадь?',
        answers: [
          {
            'answer': 'Литейный мост',
          },
          {
            'answer': 'Дворцовый мост',
          },
          {'answer': 'Троицкий мост', 'isCorrect': 1},
          {
            'answer': 'Благовещенский мост',
          },
        ]),
    Question(
        title:
            'Какому памятнику в Петербурге посвящено одноименное произведение Пушкина?',
        answers: [
          {'answer': 'Медный всадник', 'isCorrect': 1},
          {
            'answer': 'Александрийская колонна',
          },
          {
            'answer': 'Царь-плотник',
          },
          {
            'answer': 'Румянцева победам',
          },
        ]),
    Question(title: 'Кто архитектор Зимнего дворца?', answers: [
      {'answer': 'Бартоломео Франческо Растрелли', 'isCorrect': 1},
      {
        'answer': 'Карл Иванович Росси',
      },
      {
        'answer': 'Доменико Трезини',
      },
      {
        'answer': 'Огюст Монферран',
      },
    ]),
    Question(
        title: 'В каком районе города расположена киностудия Ленфильм?',
        answers: [
          {
            'answer': 'В Васильеостровском',
          },
          {
            'answer': 'В Центральном',
          },
          {'answer': 'В Петроградском', 'isCorrect': 1},
          {
            'answer': 'В Невском',
          },
        ]),
    Question(title: 'Где начинается Невский проспект?', answers: [
      {'answer': 'У Адмиралтейства', 'isCorrect': 1},
      {
        'answer': 'У площади Восстания',
      },
      {
        'answer': 'У Александро-Невской лавры',
      },
      {
        'answer': 'У Владимирской площади',
      },
    ]),
    Question(
        title:
            'На набережной какой реки расположен Большой драматический театр имени Товстоногова?',
        answers: [
          {'answer': 'На набережной реки Фонтанки', 'isCorrect': 1},
          {
            'answer': 'На набережной реки Невы',
          },
          {
            'answer': 'На набережной реки Мойки',
          },
          {
            'answer': 'На набережной реки Карповки',
          },
        ]),
    Question(
        title: 'В каком году была заложена Петропавловская крепость?',
        answers: [
          {
            'answer': 'В 1617 году',
          },
          {'answer': 'В 1703 году', 'isCorrect': 1},
          {
            'answer': 'В 1715 году',
          },
          {
            'answer': 'В 1702 году',
          },
        ]),
    Question(title: 'Какой из фактов о Неве является верным?', answers: [
      {
        'answer': 'Длина Невы около 300 км.',
      },
      {
        'answer': 'Нева — единственная река, вытекающая из Ладожского озера.',
        'isCorrect': 1
      },
      {
        'answer': 'За последние 10 лет Нева приводила к наводнениям',
      },
      {
        'answer': 'На Неве расположен только один город — Санкт-Петербург.',
      },
    ]),
  ];

  List<Question> get questions => [..._data];
}
